БИТУправление_медицинским_центром_демо/src/DataProcessors/ИнтерфейсВводаПолейЭМД/ИнтерфейсВводаПолейЭМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИнтерфейсВводаПолейЭМД</name>
  <comment>Для избранных полей особые формы ввода</comment>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/Catalogs/ИнструментальныеИсследования/ИнструментальныеИсследования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментальныеИсследования</name>
  <comment>1.2.643.5.1.13.13.11.1471</comment>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НМУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локализация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Атрибуты</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/DataProcessors/ИнтерфейсВводаПолейЭМД/Forms/АнатомическаяОбласть/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инструментальное исследование, для которого выбирается анатомическая область
	Если Параметры.Свойство("СвязанныеПараметрыШаблона") Тогда
		Для Каждого КлючИЗначение Из Параметры.СвязанныеПараметрыШаблона Цикл
			Если КлючИЗначение.Ключ.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ИнструментальныеИсследования") Тогда
				Исследование = КлючИЗначение.Значение;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исследование) Тогда
		ЗаполнитьСписокВыбораЛокализации();	
	КонецЕсли;
	
	// Если классификатор исследований допускает только одну область, она и подставляется без выбора из списка вариантов.
	// Поле ввода при этом доступно для ручного указания деталей (например, "левое" или "правое").
	Если СписокЛокализаций.Количество() = 1 Тогда
		Результат = СписокЛокализаций[0].Значение;
		Элементы.ГруппаЛокализации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
		
	ЭтотОбъект.Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Результат = Элементы.СписокЛокализаций.ТекущиеДанные.Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЛокализацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Элементы.СписокЛокализаций.ТекущиеДанные.Значение;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьСписокВыбораЛокализации()
	
	МассивЛокализаций = Справочники.ИнструментальныеИсследования.ПолучитьЛокализацииИсследования(Исследование);
	Для Каждого Локализация Из МассивЛокализаций Цикл
		СтрокаЛокализации = СписокЛокализаций.Добавить();
		СтрокаЛокализации.Значение = СокрЛП(Локализация);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
